#코드 창에 아래의 코드를 입력해 보세요.
#print("안녕하세요")


# 교체알고리즘
#a와 b값을 서로 바꿔서 a=5 b=10으로 결과를 만들고싶어요. 
a=10
b=5

# 저장하다 : 안에가 없어지고, 새로운게 들어가기
temp = a # 임시저장소에 저장후
a=b      # 10은 사라졌습니다.
b=temp
print(a, b)

####
a=10
b=5
temp = a
a = b
b = temp
print(a, b)

lst = [1,2,3,4,5,6]
# 3번값을 7로 변경, 수정 =
lst[3] = 7
print(lst)

print("mission 1-----------------")
# 좌우 데이터바꾸기
# 총 8개 중에서 4번 교체를 한다.
# [0.0, 0.5, 0.1, 0.4, 0.2, 1.0, 1.0, 0.9]
# =>[0.0, 1.0, 1.0, 0.2, 0.4, 0.1, 0.5, 0.9]

iris = [[0.0, 0.5, 0.1, 0.4, 0.2, 1.0, 1.0, 0.9],
         [1.0, 0.9, 0.0, 0.0, 0.1, 0.0, 0.3, 0.1],
         [0.2, 1.0, 0.1, 0.2, 0.3, 0.7, 1.0, 0.9],
         [0.9, 0.7, 0.5, 0.4, 0.2, 0.3, 0.0, 0.1],
         [0.1, 0.2, 0.3, 0.1, 0.6, 0.0, 1.1, 0.3],
         [0.4, 0.6, 0.7, 0.8, 0.0, 1.0, 1.1, 1.2],
         [0.0, 0.1, 0.1, 0.3, 0.2, 0.1, 0.8, 0.9],
         [0.0, 0.3, 0.1, 1.0, 0.9, 0.0, 0.5, 0.3],
         [0.4, 0.2, 0.1, 0.8, 0.4, 0.2, 0.3, 0.0],
         [0.7, 0.5, 0.4, 0.2, 0.0, 0.1, 0.1, 0.2],
         [0.1, 0.2, 0.1, 0.8, 0.4, 0.2, 0.8, 0.0],
         [0.0, 0.2, 0.3, 0.1, 0.6, 0.0, 0.7, 0.0]
         ]

for i in range(len(iris)):
    #print(iris[i],len(iris[i]) / 2)
    for j in range(int(len(iris[i]) / 2)):
        # 왼쪽숫자 iris[i][j]
        #print("l--",iris[i][j])
        # 오른쪽숫자 : 마지막번호 len(iris[i])-1
        right_j = len(iris[i])-1-j
        #print("r--",iris[i][right_j])
        # Todo: 왼쪽수사, 오른쪽숫자를 교체 해서 리스트 수정
        temp = iris[i][j]
        iris[i][j] = iris[i][right_j]
        iris[i][right_j] = temp
    #print(iris[i],"--교체이후")

print(iris)

print("\nmission 2 -------")
# 좌우 대칭 하는데 음영이 반대로 - => 양수 , 양수 => -


finger = [[1.1, -0.4, -0.1, 0.6, -0.5, 0.4, -0.2, 0.1, -0.1, 0.5, 0.0], [0.4, 0.2, 0.0, -0.7, -0.8, 0.2, 0.0, -0.5, 0.8, -0.5, 0.4], [0.1, -0.6, 0.8, -0.4, 0.0, 0.9, 0.2, -0.4, 0.1, -0.5, 0.7], [0.0, -0.5, 0.2, -0.8, 0.0, 0.7, 0.2, 2.0, -0.7, 0.2, 0.1], [-0.4, 0.4, 0.1, -0.3, -0.6, 0.3, 0.5, 0.2, 0.5, -0.6, 0.8], [0.4, 0.3, 0.2, 0.5, 0.5, 0.0, 0.0, 0.7, -0.1, 0.0, -0.5], [0.6, 0.1, 0.8, -0.7, -0.1, 0.2, -0.5, -0.7, 0.2, -0.1, 0.0], [0.0, 0.6, -0.1, 0.8, 0.0, 0.5, 0.6, 0.8, 0.3, -0.4, -0.5], [0.5, 0.8, 0.0, 0.8, 0.0, 0.0, -0.6, -0.6, 0.1, 0.6, 0.3], [0.3, -0.7, 0.5, 0.0, 0.5, 0.0, -0.4, 0.5, 0.2, -0.8, -0.7]]

# [1.1, -0.4, -0.1, 0.6, -0.5, 0.4/ -0.2, 0.1, -0.1, 0.5, 0.0]

# 교체를 할때 짝수개인지 홀수개인지를 고려할 필요가 있다.
for i in range(len(finger)):
    # print(finger[i])
    for j in range(int(len(finger[i]) / 2)+1):
        right_j = len(finger[i])-1-j
        temp = finger[i][j]
        finger[i][j] = finger[i][right_j] * -1
        finger[i][right_j] = temp * -1
print(finger)

